app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-03-28 12:02:07.732452"], ["updated_at", "2019-03-28 12:02:07.732452"]]